app/views/posts/show.html.erb

<ul>
  <% @post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = ?  [["post_id", 1]]

<h3 class="text-info">Comments:</h3>
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]